Tekla Open API Reference for Tekla Structures 2025
View.GetModelObjects Method
Overload List
Name | Description
GetModelObjects()
 Gets the model objects that are in the view.
GetModelObjects(Identifier)
 Gets the drawing model objects based on given model object identifier. If used from sheet model objects from all views are returned.
 (Inherited from ViewBase.)
Top
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace